# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanTopologySet..::..Insert Method
PlanTopologySet Class See Also
---
Insert the specified item into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	PlanTopology item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As PlanTopology _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	PlanTopology^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PlanTopologyThe item to be inserted into the set.
# ### Return Value
Returns whether the item was inserted into the set.
# See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace